Autodesk.Revit.DB.Structure.RebarStyle
Describes the usage style of a RebarShape.
The style affects the bend radius and the set of allowable hooks.
It also affects Rebar instance auto-constraining behavior.

Autodesk.Revit.DB.Structure.RebarStyle.StirrupTie
A stirrup or tie bar.

Autodesk.Revit.DB.Structure.RebarStyle.Standard
A standard or longitudinal bar.